(* 
Η συνάρτηση allpicks παίρνει ως όρισμα μια λίστα και επιστρέφει μια λίστα από tuples 
τα tuples είναι ακριβώς όσα και τα στοιχεία της λίστας
το i tuple έχει στην πρώτη θέση του το i στοιχείο της λίστας και ώς δεύτερο τη λίστα χωρίς αυτό το στοιχείο
χρησιμοποιούμε τη map για να αντικαταστίσουμε την τιμή της λίστας με την τιμή μιας συνάρτησης για input το στοιχείο αυτό
η συνάρτηση που χρησιμοποιούμε είναι η f που επιστρέφει το στοιχείο και τη λίστα χωρίς αυτό
*)


fun allpicks [] = []
  | allpicks L = 
        let 
          fun f x [] acc = rev acc
            | f x (h::t) acc = (if x = h then f x t acc else f x t (h::acc))
        in
        map (fn x => (x,f x L [])) L
        end
